Tekla Open API Reference for Tekla Structures 2025
TaskFilterExpressions.Critical Constructor
 Initializes a new instance of the Critical class.
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Critical()
Public Sub New
See Also
Reference
TaskFilterExpressions.Critical Class
Tekla.Structures.Filtering.Categories Namespace